src/app/controllers/configurator_controller.rb

INSERT INTO "products" ("battery_id", "created_at", "name", "type", "updated_at") VALUES (?, ?, ?, ?, ?)  [["battery_id", 0], ["created_at", Thu, 13 Mar 2014 16:15:11 UTC +00:00], ["name", "battery01"], ["type", "Battery"], ["updated_at", Thu, 13 Mar 2014 16:15:11 UTC +00:00]]
SELECT "products".* FROM "products" WHERE "products"."type" IN ('Tank') AND (id < NULL) ORDER BY "products"."id" ASC LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
	def index
		#self.generate
		@wobj = []
		Product.create!(name:"battery01",type:"Battery")

		Product.all.each do |prod|
		end
			 obj = Product.find(Product.last.id - 1)