src/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
		# comment this out once DB is set up
		@user = User.find(params[:id])