app/controllers/product_list_controller.rb

SELECT "products".* FROM "products" WHERE ("products"."type" != 'Kit')
---
	def list
		@page = Constants::PAGE_PROD_LIST
		@add_or_change = "Add"
		# limit to 20 items for faster loading during development;
		# exclude kits because we are not handling them als products yet
		@conf_objects = params["conf"] || {}

		if params["type"].nil?
			@part_type = "Part"
			# limit to 20 items for faster loading during development;
			# exclude kits because we are not handling them als products yet
			@prods = Product.where.not(type: "Kit").page(params[:page]).per(10)